{
  "backend/main.mo": "Main backend actor that includes blob storage mixin and manages video metadata (id, blob reference, name) with functions to add, retrieve single, and retrieve all videos using a Map data structure.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: video upload with progress bar, video feed with thumbnails, video playback with controls, and Nexustube branding with red/orange color scheme and dark gradient background.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 12 frontend files covering routing, components (Header, Footer, VideoUpload, VideoFeed, VideoCard, VideoPlayer), pages (HomePage, VideoPlaybackPage), hooks (useQueries), and styling (index.css, tailwind.config.js).",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system variables for light and dark themes with custom design tokens for background, foreground, borders, and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, \"Nexustube\" title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home and video playback pages, ThemeProvider for dark mode, QueryClientProvider wrapper, and layout with Header, Footer, and Toaster components.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright year, Nexustube tagline \"Create. Connect. Earn.\", and attribution link to caffeine.ai with UTM tracking parameters and heart icon.",
  "frontend/src/components/Header.tsx": "Sticky header with Nexustube logo (gradient red-to-orange), brand name, and Upload Video button that scrolls to upload section on click.",
  "frontend/src/components/VideoCard.tsx": "Reusable card component displaying video thumbnail with hover effects, play button overlay, video name, and truncated ID that navigates to video playback page on click.",
  "frontend/src/components/VideoFeed.tsx": "Video feed component fetching all videos via useGetAllVideos hook and displaying them in responsive grid with loading spinner, error state, and empty state messaging.",
  "frontend/src/components/VideoPlayer.tsx": "Custom HTML5 video player with play/pause toggle, mute/unmute, volume slider, seek bar with time display, fullscreen toggle, and overlay controls that appear on hover.",
  "frontend/src/components/VideoUpload.tsx": "React component for uploading videos with file selection, progress tracking, and form validation. Converts selected video files to ExternalBlob and submits them via the useAddVideo mutation hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP actor instance based on Internet Identity authentication state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state and identity persistence. Wraps @dfinity/auth-client with React state management and lifecycle handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for video data operations including fetching all videos, fetching individual videos by ID, and adding new videos. Uses the actor from useActor hook to interact with the backend canister.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining the Nexustube dark theme color palette using OKLCH color space. Includes brand colors (nexus-red and nexus-orange) and a gradient background.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component. Wraps the app with necessary context providers for state management and authentication.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component displaying a hero section, video upload interface, and video feed. Organized into three sections with gradient backgrounds and brand styling.",
  "frontend/src/pages/VideoPlaybackPage.tsx": "Video playback page that fetches and displays a single video by ID from route parameters. Includes loading states, error handling, and navigation back to home.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH color space, container settings, animations, and plugins. Defines Nexustube brand colors and design system tokens.",
  "project_state.json": "Project state file for Nexustube, a content creation and monetization platform with video sharing, posts, chat, earnings, profile, and store features. Tracks implemented features (video upload, feed, playback, branding) and pending backend storage implementation."
}